In [1]:
import  numpy as np 
import pandas as pd

# STRING METHODS

In [2]:
email = "jose@gmail.com" 

email.split("@")

['jose', 'gmail.com']

In [3]:
names = pd.Series(["andre" , "pepe" , "Keyla"])

names.str.upper()

0    ANDRE
1     PEPE
2    KEYLA
dtype: object

In [4]:
tech_fin = pd.Series(["GOOG,AMZN,APP" , "JPM,BAC,GS"])

tech_fin.str.split("," , expand=True)

      0     1    2
0  GOOG  AMZN  APP
1   JPM   BAC   GS

In [5]:
def string_fun (name):
    "this function  is to crrect strings"

    name=name.replace(";", "")
    name=name.strip()
    name=name.capitalize()
    
    return name

In [6]:
fun = pd.Series(["Ka;ka" , " Messi" , "cr7" , "pirlo"])

fun.apply(string_fun)

0     Kaka
1    Messi
2      Cr7
3    Pirlo
dtype: object

# TIME METHODS

In [7]:
from datetime import datetime

In [8]:
myyear = 2019
mymonth = 9
myday = 28
myhour = 2
myminute = 30 
mysec= 15

In [9]:
mydate = datetime ( myyear , mymonth, myday  )

mydatetime = datetime( myyear , mymonth, myday  , myhour , myminute , mysec )

In [40]:
myser = pd.Series(["Nov 3, 1990" , "2000-01-01 " , None ])

In [41]:
pd.to_datetime(myser , format="mixed")

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [45]:
sales = pd.read_csv("/home/jdiego/Documentos/MACHINE_LEARNING_DATA_SCIENCE/UNZIP_FOR_NOTEBOOKS_FINAL/DATA/RetailSales_BeerWineLiquor.csv")

In [44]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [47]:
sales["DATE"] = pd.to_datetime(sales["DATE"])

In [49]:
sales = pd.read_csv("/home/jdiego/Documentos/MACHINE_LEARNING_DATA_SCIENCE/UNZIP_FOR_NOTEBOOKS_FINAL/DATA/RetailSales_BeerWineLiquor.csv" , 
parse_dates=[0])

In [50]:
sales["DATE"]

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]